In [1]:
import pandas as pd
import pyarrow
import openpyxl

In [2]:
df1=pd.read_csv(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf1.csv"
               ,sep="/"
               )
df2=pd.read_parquet(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf2.parquet"
                   ,use_nullable_dtypes=True
                   ,engine="pyarrow")
df3=pd.read_csv(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf3.txt"
               ,sep=" ")
df4=pd.read_excel(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf4.xlsx")

C:\Users\sqladmin\AppData\Local\Temp\2\ipykernel_3932\962080886.py:4: FutureWarning: The argument 'use_nullable_dtypes' is deprecated and will be removed in a future version.Use dtype_backend='numpy_nullable' instead of use_nullable_dtype=True.
  df2=pd.read_parquet(r"C:\PythonWorkshop\wsbpythonfiles\Zadania\ZadaniaDf2.parquet"

In [6]:
df4.head()

        City     Zone
0  Stockholm   Europe
1     Denver  America
2     Moscow     Asia
3  Marseille   Europe
4    Palermo   Europe

In [7]:
print(df1.info(show_counts=True))
print(df2.info(show_counts=True))
print(df3.info(show_counts=True))
print(df4.info(show_counts=True))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000000 entries, 0 to 4999999
Data columns (total 10 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   Invoice_Id       5000000 non-null  object
 1   account_name     4772470 non-null  object
 2   account_surname  4231219 non-null  object
 3   age              5000000 non-null  int64
 4   product          4443677 non-null  object
 5   order_city       4688008 non-null  object
 6   color            5000000 non-null  object
 7   date             5000000 non-null  object
 8   delivery_date    5000000 non-null  object
 9   production_date  5000000 non-null  int64
dtypes: int64(2), object(8)
memory usage: 381.5+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000000 entries, 0 to 4999999
Data columns (total 9 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   account_name              5000000 non-null  object
 1   account_surname           5000000 non-null  object
 2   Invoice_Id                5000000 non-null  object
 3   discount                  5000000 non-null  object
 4   ordered                   5000000 non-null  int32
 5   quantity                  5000000 non-null  int32
 6   region                    5000000 non-null  object
 7   additional_delivery_cost  5000000 non-null  object
 8   wrh_city                  5000000 non-null  object
dtypes: int32(2), object(7)
memory usage: 305.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000000 entries, 0 to 4999999
Data columns (total 8 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   Invoice_Id                5000000 non-null  object
 1   discount                  3999612 non-null  float64
 2   ordered                   5000000 non-null  int64
 3   quantity                  5000000 non-null  int64
 4   region                    0 non-null        float64
 5   additional_delivery_cost  5000000 non-null  object
 6   wrh_city                  5000000 non-null  object
 7   price                     5000000 non-null  int64
dtypes: float64(2), int64(3), object(3)
memory usage: 305.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   City    15 non-null     object
 1   Zone    15 non-null     object
dtypes: object(2)
memory usage: 372.0+ bytes
None

In [10]:
df1.head()

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date
0,Invoice: 1A,Patricia,Old_Clifford,28,NaN,Stockholm,black,2014-09-10,2014-09-25,20140908
1,Invoice: 2A,John,Luciano,31,Prod C,Palermo,orange,2010-11-29,2010-11-30,20101125
2,Invoice: 3A,Elizabeth,Clifford,32,NaN,Nairobi,indigo,2010-05-30,2010-06-09,20100529
3,Invoice: 4A,Robert,Vallllentine,25,Prod D,NaN,green,2017-02-01,2017-02-05,20170129
4,Invoice: 5A,patricia,Peroni,47,Prod A,Marseille,orange,2017-01-29,2017-02-13,20170127

In [26]:
df1.duplicated().sum()

0

In [33]:
df1.duplicated(subset=["Invoice_Id","account_name","account_surname","age","order_city"]).sum()

0

In [25]:
df1.isnull().sum()

Invoice_Id              0
account_name       227530
account_surname    768781
age                     0
product            556323
order_city         311992
color                   0
date                    0
delivery_date           0
production_date         0
dtype: int64

In [30]:
df2.sample(5)

,account_name,account_surname,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city
3802715,Robert,Vallentine,Invoice: 3802716A,0.2,53,41,,T,Wroclaw_Marseille
3188312,Linda,Hawkins,Invoice: 3188313A,0.1,19,10,,T,Wroclaw_Madrid
746006,Patricia,Hawkins,Invoice: 746007A,0.2,31,18,,TC,Krakow_Río de Janeiro
4705493,patricia,Nici,Invoice: 4705494A,0.4,78,64,,TF,Krakow_Tokyo
2874184,Susan,Nici,Invoice: 2874185A,0.1,30,23,,TC,Wroclaw_Milwaukee

In [34]:
df2.duplicated(subset="Invoice_Id").sum()

0

In [15]:
df2.isnull().sum()

Invoice_Id              0
account_name       227530
account_surname    768781
age                     0
product            556323
order_city         311992
color                   0
date                    0
delivery_date           0
production_date         0
dtype: int64

In [35]:
df3.sample(5)

,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price
2671035,Invoice: 2671036A,0.3,47,34,NaN,TC,Warsaw_Denver,9
3699625,Invoice: 3699626A,0.1,12,2,NaN,TF,Poznan_Nairobi,9
1980206,Invoice: 1980207A,NaN,23,8,NaN,T,Warsaw_Madrid,5
4141681,Invoice: 4141682A,NaN,86,74,NaN,T,Warsaw_Marseille,7
739028,Invoice: 739029A,NaN,51,37,NaN,T,Warsaw_Marseille,9

In [36]:
df3.duplicated(subset="Invoice_Id").sum()

0

In [37]:
df4.sample(5)

         City    Zone
2      Moscow    Asia
13     Madrid  Europe
3   Marseille  Europe
0   Stockholm  Europe
12     Manila    Asia

In [41]:
df4.duplicated().sum()

0

In [42]:
df1.sample()

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date
645274,Invoice: 645275A,Jennifer,Vallllentine,46,Prod F,NaN,pink,2017-06-08,2017-06-24,20170605

In [43]:
df2.sample()

,account_name,account_surname,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city
3192483,Michael,Old_Clifford,Invoice: 3192484A,,97,84,,T,Warsaw_Oslo

In [47]:
df2.columns

Index(['account_name', 'account_surname', 'Invoice_Id', 'discount', 'ordered',
       'quantity', 'region', 'additional_delivery_cost', 'wrh_city'],
      dtype='object')

In [44]:
u_df1_df2 = df1.merge(right=df2,how="outer",right_on="Invoice_Id",left_on="Invoice_Id")

In [48]:
#"Invoice_Id", "discount", "ordered" ,"quantity", "region", "additional_delivery_cost", "wrh_city"
u_df1_df2 = df1.merge(
    right=df2[["Invoice_Id", "discount", "ordered" ,"quantity", "region", "additional_delivery_cost", "wrh_city"]]
    ,how="outer",right_on="Invoice_Id",left_on="Invoice_Id")

In [49]:
u_df1_df2.sample(5)

,Invoice_Id,account_name,account_surname,age,product,order_city,color,date,delivery_date,production_date,discount,ordered,quantity,region,additional_delivery_cost,wrh_city
2862153,Invoice: 2862154A,Mary,Peroni,38,Prod B,NaN,brown,2015-09-26,2015-10-10,20150919,0.2,46,42,,?,Wroclaw_
3499257,Invoice: 3499258A,James,Vallentine,63,Prod F,Denver,white,2016-10-17,2016-10-26,20161013,0.3,23,7,,TC,Warsaw_Denver
4689843,Invoice: 4689844A,Patricia,NaN,56,Prod F,Palermo,orange,2017-08-28,2017-09-08,20170818,0.1,21,19,,T,Warsaw_Palermo
3410339,Invoice: 3410340A,Mary,Old_Robust,39,Prod D,Milwaukee,pink,2017-03-03,2017-03-21,20170222,0.1,57,48,,TC,Krakow_Milwaukee
1006717,Invoice: 1006718A,Michael,Clifford,40,NaN,Palermo,white,2014-09-24,2014-10-12,20140912,,57,50,,T,Wroclaw_Palermo

In [50]:
df3.sample(5)

,Invoice_Id,discount,ordered,quantity,region,additional_delivery_cost,wrh_city,price
1057984,Invoice: 1057985A,0.3,98,87,NaN,T,Krakow_Moscow,9
3543586,Invoice: 3543587A,0.2,12,10,NaN,T,Poznan_Marseille,5
2086904,Invoice: 2086905A,0.1,57,50,NaN,T,Poznan_Oslo,7
1333430,Invoice: 1333431A,0.4,97,93,NaN,T,Krakow_Stockholm,9
2505847,Invoice: 2505848A,0.3,64,49,NaN,T,Poznan_Berlin,5

In [55]:
u_df1_2_3 = u_df1_df2.merge(right=df3,how="left",right_on="Invoice_Id",left_on="Invoice_Id")